[{"url":"/","title":"Video Background Pro Docs","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"}],"content":"\n# Welcome to the Video Background Pro docs!\n\nHere you'll find all the information you'll need in order to get up and running with Video Background Pro. Get started by clicking one of the documents below."},{"url":"/downloading-installing/","title":"Downloading and Installing","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Downloading and Installing","url":"/downloading-installing/"}],"content":"\n# Downloading & Installing\n\nDuring the checkout process, you will create an account from your email and from the password field. Once you have successfully purchased the plugin, you can [login to your account page.](https://pushlabs.co/my-account/my-api-downloads/)\n\nOnce you are logged into your account, click downloads on the sidebar to go to the [downloads page](https://pushlabs.co/my-account/my-api-downloads/), then click **Download**. This will download the plugin in `.zip` format to be uploaded to WordPress.\n\n**Please keep in mind that Video Background Pro is a different plugin than \"Video Background\" on the WordPress repo. You must still install Video Background Pro even if you have \"Video Background\" installed.**\n\nOnce the plugin has downloaded, go to your WordPress admin, and navigation to `Plugins > Add New (button at the top) > Upload Plugin`. Drag the file to the upload window.\n\nYou can now click **Install Now**, then **Activate Plugin** on the next window to successfully install the plugin 🥳"},{"url":"/activating/","title":"Activating","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Activating","url":"/activating/"}],"content":"\n# Activating\n\nVideo Background Pro must be activated in order to use it. Once you purchase the plugin, you will be granted a license key and email (the email you made the purchase with). [You can view your license keys in your account.](https://pushlabs.co/my-account/my-api-keys/)\n\nOnce you have your license key and email, you can authenticate the plugin by going to `WordPress Admin > Settings > Video Background Pro Activation` page. From there, you can enter your license key and email and click **Save Changes**.\n\nDoing this will authenticate the WordPress instance to the Push Labs server to receive updates through the native WordPress Plugin Updater.\n\n## Activation Limits\n\nDepending on the license you purchased through Push Labs, you may have 1, 5, 25 activations. This means that you can activate the plugin on this many WordPress installations respectively. If you would like to increase your activations, [please contact me for a license upgrade.](mailto:blake@pushlabs.co)\n\n## Managing Your Current Activations\n\nYour current activations can be viewed/deleted from the [License Keys page of your account](https://pushlabs.co/my-account/my-api-keys/). From the License Keys page, you can view all of your current license keys and emails, the amount of current activations, the timestamps when they were activated, on which domain they were activated, as well as a delete button for each instance.\n\nThis is very useful in the case that your WordPress instance gets wiped or is inaccessible, as you still have the ability to remove that particular instance."},{"url":"/updating/","title":"Updating","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Updating","url":"/updating/"}],"content":"\n# Updating\n\nUpdating the plugin will allow you to keep up-to-date with new features and improvements. Since modern browsers are constantly changing, it's important to have the latest version so your video backgrounds are compatible with browsers and devices.\n\nSince version 2.1.0, Video Background Pro has a built in update tool that will look for updates and can be updated right from the native WordPress plugins page. This means that keeping up-to-date in Video Background Pro can be done in a matter of a few clicks. In order for this to work, it's important that you activate your plugin.\n\n## Updating the Plugin Manually\n\nIt is also possible to update the plugin manually by downloading the Video Background Pro update from the [downloads section of your Push Labs account](https://pushlabs.co/my-account/my-api-downloads/), and uploading the files through FTP to `/wp-content/plugins/video-background-pro`.\n\nFor more information regarding manually updating a plugin, [please take a look at WPBeginner’s Article](http://www.wpbeginner.com/beginners-guide/how-to-manually-update-wordpress-plugins-via-ftp/)."},{"url":"/your-license-keys/","title":"Your License Keys","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Your License Keys","url":"/your-license-keys/"}],"content":"\n# Your License Keys\n\nWhen purchasing Video Background Pro, a license key is generated for you. Additionally, the email you used to purchase Video Background Pro becomes your license email for that generated license.\n\nEach license key has an amount of activations associated with it. Currently, Video Background Pro sells 1 site, 5 site, and 25 site licenses. This amount of activations reflects how many WordPress sites you can have the plugin activated.\n\nYou can view all of your licenses at the [License Keys page of your account.](https://pushlabs.co/my-account/my-api-keys/)\n\n## Lost License\n\nIf you have lost your license, you can [recover it here](https://pushlabs.co/lost-license/). Remember to recover the license with the email address that you originally purchased the plugin with, as it is associated with your license key."},{"url":"/finding-your-container/","title":"Finding your Container","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Finding your Container","url":"/finding-your-container/"}],"content":"\n# Finding Your Container\n\n<div style=\"padding-top: 56.25%; position: relative;\">\n    <iframe style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%;\" src=\"https://www.youtube.com/embed/oTHcCfta1Q0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div>\n\n## Overview\n\nFinding your container may be the most important aspect of using Video Background Pro. The container tells the plugin where to place the video background.\n\n## What Is a Container?\n\nA container in Video Background Pro is nothing more than a [CSS Selector](https://www.w3schools.com/cssref/css_selectors.asp). A [selector](https://www.w3schools.com/cssref/css_selectors.asp) allow you to specify what element on a webpage you want to target. If you are new to selectors, I highly recommend taking a look at this w3schools article [CSS Syntax and Selectors](https://www.w3schools.com/css/css_syntax.asp). It will save you a lot of time looking for your container.\n\n## How Do I Find My Container?\n\nIn order to find your container, you'll need a browser with developer tools. I would recommend using Google Chrome for this.\n\n1. Start by hovering your mouse over the area in which you want the video background to appear.\n2. Right click and select the **inspect** menu item. This will open the developer tools.\n3. You'll notice a new window pops up with a hierarchical list of elements to the left. This is called the [DOM](https://www.w3schools.com/js/js_htmldom.asp). It is a tree of HTML elements. One of these elements is your container.\n4. Since you were hovering over the area where you want your video background to be placed, the selected element should be close, if not correct. You'll know that the selected element is your container when you hover over it, and blue and or green fill up the entire area of where you want the video background to be placed. Feel free to watch the tutorial above for a more in depth demonstration.\n\n[For an in depth dive into finding selectors, take a look at this tutorial by Google.](https://developers.google.com/web/tools/chrome-devtools/dom/)\n\n\n## Once I Have Found My Container, How Do I Reference It?\n\nSay we have found the element you want to target for a video background, and it looks like this:\n\n```html\n<div id=\"masthead\" class=\"site-header\">\n    ...\n</div>\n```\n\nIn Video Background Pro, you can reference this element two ways:\n\n* By the id attribute\n* By the class attribute\n\n**In HTML, id attributes have to be unique while classes can be used multiple times throughout the web page.**\n\nBecause of this, it is best to reference the ID over the class, as it has less of a chance of conflicting with other elements.\n\nWhen referring to an ID in Video Background Pro, it must be prefixed by a hashtag. This let's the browser know that you are trying to reference an ID. So you would enter the following in the Video Background Pro container field:\n\n```css\n#masthead\n```\n\nAlternatively, if you wanted to reference the class, you would prefix it with a period:\n\n```css\n.site-header\n```"},{"url":"/using-the-shortcode/","title":"Using the Shortcode","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Using the Shortcode","url":"/using-the-shortcode/"}],"content":"\n# Using the Shortcode\n\nThe shortcode is the backbone of the entire Video Background Pro plugin. Whether or not you realize it, every other way to create a video background (metabox, WPBakery, SiteOrigin) all end up using the shortcode to initialize the plugin and add it to your website.\n\n## Parameters\n\nThe shortcode has parameters that you can specify to tailor your video background experience.\n\n**It's important to note that due to the way that shortcodes are implemented, every value is interpreted as a string.**\n\n| Parameter | Description | Type | Accepts | Default Value\n| -|-| -| -| -|\n| container | The container value. This is where your video background will go. This parameter is required. | Any | Any DOM Element | `\"\"`\n| type | The type of video background you would like. | Any | self-host, youtube, vimeo | \"self-host\"\n| mp4 | The .mp4 file link. | `self-host` | Any URL with an `.mp4` file extension. | \"null\"\n| webm | The .webm file link. | `self-host` | Any URL with a `.webm` file extension. | \"null\"\n| youtube_url | The YouTube URL. Can be any type of YouTube URL (shortened, regular, embed, etc).| `youtube` | Any YouTube video URL. | \"null\"\n| youtube_start | The YouTube video background start second. This must be a number, not the minutes and seconds. For example, if you want the video to start at 1:32, you would input 92. | `youtube` | A number less than the total amount of seconds in the YouTube video. | \"0\"\n| youtube_end | The YouTube video background end second. This must be a number, not the minutes and seconds. For example, if you want the video to end at 1:32, you would input 92. | `youtube` | A number less than the total amount of seconds in the YouTube video. | \"null\"\n| vimeo_url | The Vimeo video URL. | `vimeo` | A Vimeo Video URL ex. https://vimeo.com/xxxx where \"xxxx\" is the ID. | \"null\"\n| poster | The poster image will be shown while the video is loading and for devices/browsers that do not support video backgrounds. | Any | Any URL to an image. .png and .jpg are recommended. | \"null\"\n| end_frame_poster | This option will add the poster image to the video background once it stops playing. The `loop` parameter must be set to `false` for this to work. | Any | `true` or `false` | \"false\"\n| muted | This option has been depreciated due to browser restrictions. As of Video Background Pro 3.0.0 this option will no longer do anything. | Any | `true` or `false` | \"true\"\n| loop | This option will dictate whether or not the video background will loop. | Any | `true` or `false` | \"true\"\n| overlay | To enable the overlay or not. | Any | `true` or `false` | \"false\"\n| overlay_color | Specify the color of the overlay as a hex color. The `overlay` parameter must be set to `true` for this to take effect. | Any | Any Hex color. | \"#000\"\n| overlay_alpha | Specify the amount of transparency your overlay will have. This can be useful for text legibility. | Any | A value between `0.00` and `1.00` where `0.00` is completely transparent and `1.00` begin opaque. | \"0.3\"\n| overlay_texture_url | This option was depreciated in Video Background Pro 4.0.0, and will no longer do anything. | Any | Any URL to an image. | \"#\"\n| frontend_play_button | Toggle a play/pause button for the video background. | Any | `true` or `false` | \"false\"\n| frontend_volume_button | Toggle a mute/unmute button for the video background. | Any | `true` or `false` | \"false\"\n| frontend_position | Specify the position of the frontend buttons. Either `frontend_play_button`, `frontend_volume_button` or both must be enabled. | Any | `bottom-right`, `bottom-left`, `top-right`, `top-left` | \"bottom-right\"\n| enable_loader | This option was depreciated in Video Background Pro 4.0.0, and will no longer do anything. | Any | `true` or `false` | \"false\"\n| play_on_mobile | This option was depreciated in Video Background Pro 4.0.0, and will no longer do anything. Now, the video background will play on any mobile browser that supports HTML5 `<video>`. | Any | `true` or `false` | \"true\"\n| player_options | Allows you to interact with the player's API. Can be used for `self-host`, `youtube`, and `vimeo` video backgrounds. Make a JSON string of an object with the options that you would like to add/override. | Any | A JSON String with an object of key:value pairs. | \"null\"\n| frontend_container | Use this option if you'd like to re-position your frontend buttons. Used just like the `container` parameter, simply provide a DOM element for it to be moved to. | Any | Any DOM Element | \"null\"\n\n## Constructing the Shortcode\n\nWhen you are constructing the shortcode, you only need to add the parameters that matter to you. In this instance, say we have a container `.my-section-5` and we want a YouTube video background of [Rick Astley's \"Never Gonna Give You Up\"](https://www.youtube.com/watch?v=dQw4w9WgXcQ). Our shortcode would look something like this:\n\n```\n[vidbg container=\".my-section-5\" type=\"youtube\" youtube_url=\"https://www.youtube.com/watch?v=dQw4w9WgXcQ\"]\n```"},{"url":"/using-the-metabox/","title":"Using the Metabox","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Using the Metabox","url":"/using-the-metabox/"}],"content":"\n# Using the Metabox\n\n<div style=\"padding-top: 56.25%; position: relative;\">\n    <iframe style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%;\" src=\"https://www.youtube.com/embed/99AbNRCvo48\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div>\n\nThe metabox in video background pro is the most common way of adding a video background to your website. It lets you easily configure options, and will enable you to get up and running in a short amount of time."},{"url":"/using-wpbakery/","title":"Using WPBakery","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Using WPBakery","url":"/using-wpbakery/"}],"content":"\n# Using WPBakery to Create a Video Background\n\nWPBakery is a great tool to create website elements without much coding experience. Thankfully, Video Background Pro has a great WPBakery integration that lets you add video backgrounds through WPBakery `Row` elements.\n\n**First thing is first, you'll want to have content in your row before you start. Since the video background is sized according to the container, if there is no content, the height will be `0`.**\n\nHere are the steps to create a video background successfully with WPBakery:\n\n1. Make sure WPBakery is installed in `WordPress Admin > Plugins`\n2. Navigate to the page you would like the video background to appear on\n3. Make sure you are using the WPBakery **Backend Editor**\n4. Create a row by selecting the **plus icon**, then selecting the **Row** item\n5. Select the **pencil icon** in the top-right corner of the row to bring up the settings\n6. Click the **Video Background** tab, and fill in the fields as necessary.\n7. Save changes\n\nCongrats, you've added a video background through WPBakery!"},{"url":"/using-siteorigin/","title":"Using SiteOrigin","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Using SiteOrigin","url":"/using-siteorigin/"}],"content":"\n# Using SiteOrigin Page Builder to Create a Video Background\n\nSiteOrigin Page Builder is a great tool to create website elements without much coding experience in WordPress. Thankfully, Video Background Pro has a great SiteOrigin integration that lets you add video backgrounds through SiteOrigin Page Builder's `Row` widgets.\n\n**First thing is first, you'll want to have content in your row before you start. Since the video background is sized according to the container, if there is no content, the height will be `0`.**\n\n1. Make sure SiteOrigin Page Builder is installed in `WordPress Admin > Plugins`\n2. Navigate to the page you would like the video background to appear on\n3. Click the **Page Builder** tab\n4. Create a row by selecting the **Add Row** button\n5. You will be prompted to select the amount of columns you want in your row. Select the correct amount and click the **insert** button\n6. Edit the row by hovering over the **wrench icon** in the top-right hand corner of the row and selecting **Edit Row**\n7. Click the **Video Background** tab, and fill in the fields as necessary.\n8. Save changes"},{"url":"/methods/","title":"Using Methods","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Using Methods","url":"/methods/"}],"content":"\n# Using Methods\n\nMethods allow you to execute certain actions on your video background instance. Current methods provide the ability to play, pause, mute, unmute, and resize a video background.\n\n```js\n// Be sure to use your own container!\nvar container = '.your-container'\n\n// Method to play a video background\njQuery(container).data('vidbgpro').playVidbg();\n\n// Method to pause a video background\njQuery(container).data('vidbgpro').pauseVidbg();\n\n// Method to mute a video background\njQuery(container).data('vidbgpro').muteVidbg();\n\n// Method to unmute a video background\njQuery(container).data('vidbgpro').unMuteVidbg();\n\n// Method to resize a video background\njQuery(container).data('vidbgpro').resizeVidbg();\n```\n\nIt is important to make sure you call these methods after Video Background Pro has initialized."},{"url":"/filters/add-dependencies-for-the-frontend-scripts/","title":"Add Dependencies For The Frontend Scripts","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Filters"},{"title":"Add Dependencies For The Frontend Scripts","url":"/filters/add-dependencies-for-the-frontend-scripts/"}],"content":"# Add Dependencies for the Frontend Scripts\n\nA theme or plugin may be conflicting with Video Background Pro. In that case, you could require Video Background pro to enqueue after those plugin/theme scripts to avoid any conflicts using the filter below:\n\n```php\n<?php\n/**\n * Define Video Background Pros Script Dependencies\n *\n * @since 2.2.0\n * @author Push Labs\n * @param Array $deps The dependencies for the Video Background Pro plugin\n * @return Array $deps\n */\nfunction themeprefix_vidbgpro_deps( $deps ) {\n  $deps = array( 'jquery' );\n  return $deps;\n}\nadd_filter( 'vidbgpro_script_deps', 'themeprefix_vidbgpro_deps' );\n```"},{"url":"/filters/adding-the-metabox-to-custom-post-types/","title":"Adding The Metabox To Custom Post Types","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Filters"},{"title":"Adding The Metabox To Custom Post Types","url":"/filters/adding-the-metabox-to-custom-post-types/"}],"content":"# Adding the Metabox to Custom Post Types\n\nTo add the Video Background Pro metabox to a custom post type, add the function below to the bottom of your `functions.php` file. In the `$post_types` array, add your desired custom post types.\n\n```php\n<?php\n/**\n * Define Video Background Pros post types\n *\n * @since 1.1.2\n * @author Push Labs\n * @param array $post_types\n * @return array Array of post types Video Background Pro should use\n */\nfunction themeprefix_vidbgpro_post_types( $post_types ) {\n  /**\n   * list the post types you would like Video Background Pro\n   * to use in the form of an array\n   */\n  $post_types = array( 'post', 'page' );\n  return $post_types;\n}\nadd_filter( 'vidbgpro_post_types', 'themeprefix_vidbgpro_post_types' );\n```"},{"url":"/filters/change-the-priority-of-the-metabox/","title":"Change The Priority Of The Metabox","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Filters"},{"title":"Change The Priority Of The Metabox","url":"/filters/change-the-priority-of-the-metabox/"}],"content":"# Change the Priority of the Metabox\n\nIf you would like to change the position of the Video Background Pro metabox, you can achieve this through a filter. Add the function below to the end of your `functions.php` file. In the `$priority` variable, define the priority.\n\n```php\n<?php\n/**\n * Define Video Background Pros metabox priority\n *\n * @since 2.0.0\n * @author Push Labs\n * @uses apply_filters()\n * @return string The location of the metabox used by WordPress\n * @link https://developer.wordpress.org/reference/functions/add_meta_box/\n */\nfunction themeprefix_vidbgpro_metabox_priority( $priority ) {\n  /**\n   * The metabox priority. For more information refer to:\n   * @link https://developer.wordpress.org/reference/functions/add_meta_box/\n   */\n  $priority = 'high';\n  return $priority;\n}\nadd_filter( 'vidbgpro_metabox_priority', 'themeprefix_vidbgpro_metabox_priority' );\n```"},{"url":"/filters/disable-siteorigin-integration/","title":"Disable Siteorigin Integration","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Filters"},{"title":"Disable Siteorigin Integration","url":"/filters/disable-siteorigin-integration/"}],"content":"# Disable the SiteOrigin Page Builder Integration\n\nIf you need to disable the SiteOrigin Page Builder integration, you could do so using this filter:\n\n```php\n<?php\n/**\n * Disable Video Background Pros SiteOrigin Page Builder Integration\n *\n * @since 3.0.0\n * @author Push Labs\n * @param Boolean $is_enabled Boolean decisison to enable/disable the integration\n * @return Boolean $is_enabled\n */\nfunction themeprefix_vidbgpro_disable_siteorigin( $is_enabled ) {\n  $is_enabled = false;\n  return $is_enabled;\n}\nadd_filter( 'vidbgpro_enable_siteorigin', 'themeprefix_vidbgpro_disable_siteorigin' );\n```"},{"url":"/filters/disable-wpbakery-integration/","title":"Disable Wpbakery Integration","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Filters"},{"title":"Disable Wpbakery Integration","url":"/filters/disable-wpbakery-integration/"}],"content":"# Disable the WPBakery Integration\n\nIf you need to disable the WPBakery (Visual Composer) integration, you could disable it using the following filter:\n\n```php\n<?php\n/**\n * Disable Video Background Pros Visual Composer Integration\n *\n * @since 2.2.0\n * @author Push Labs\n * @param Boolean $is_enabled Boolean decisison to enable/disable the integration\n * @return Boolean $is_enabled\n */\nfunction themeprefix_vidbgpro_disable_vc( $is_enabled ) {\n  $is_enabled = false;\n  return $is_enabled;\n}\nadd_filter( 'vidbgpro_enable_vc', 'themeprefix_vidbgpro_disable_vc' );\n```"},{"url":"/troubleshooting/activation-issues/","title":"Activation Issues","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Troubleshooting"},{"title":"Activation Issues","url":"/troubleshooting/activation-issues/"}],"content":"# Fixing Activation Issues\n\nIt is possible for the activation process to get stuck in limbo if the server connection times out or if the connection is interrupted.\n\nIf this happens, there are a few steps you can take to revert the activation, and try again. Start with the following steps:\n\n1. Deactivate Video Background Pro under `WordPress Admin > Plugins`\n2. Go to [your API Keys](https://pushlabs.co/my-account/my-api-keys/) and remove any keys for the domain you are trying to activate\n3. Reactivate Video Background Pro under `WordPress Admin > Plugins`\n4. Enter your license key and email found on the [API Keys page](https://pushlabs.co/my-account/my-api-keys/)\n\nThis should allow you to activate the plugin successfully. Otherwise, please reach out and we can assist with activation."},{"url":"/troubleshooting/auto-playback-with-audio-issues/","title":"Auto Playback With Audio Issues","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Troubleshooting"},{"title":"Auto Playback With Audio Issues","url":"/troubleshooting/auto-playback-with-audio-issues/"}],"content":"# Auto Playback with Audio\n\nDue to Chrome, Safari, and other browsers' policy of disabling auto-playing video with sound, Video Background Pro has decided to remove the `muted` parameter, and now will always start video backgrounds with the sound muted.\n\nVideo Background Pro still offers the frontend volume button, however, and can be toggled by your users to mute/unmute the audio of the video background."},{"url":"/troubleshooting/container-sizing-issues/","title":"Container Sizing Issues","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Troubleshooting"},{"title":"Container Sizing Issues","url":"/troubleshooting/container-sizing-issues/"}],"content":"# Container Sizing Issues\n\nIn Video Background Pro, the video background is always the size of the container that you specify. This means that if the container is an element with 50 pixels in width and height, that will be the size of the video background. **Additionally, if your container's height is 0 pixels or it does not have any content inside of it, the video background will not show up since the container is essentially non-existent.**\n\nThe best way to control the size of the container is to use CSS. Say you have a container:\n```html\n<div class=\"my-video-background\">\n    ...\n</div>\n```\n\nThat means that you can use the CSS selector `.my-video-background` to modify the height of the container:\n\n```css\n.my-video-background {\n    height: 500px;\n}\n```\n\nThis code, however, is not very responsive. You could use media queries to take care of that!\n\n```css\n.my-video-background {\n    height: 500px;\n}\n\n@media (max-width: 960px) {\n    .my-video-background {\n        height: 400px;\n    }\n}\n\n@media (max-width: 560px) {\n    .my-video-background {\n        height: 250px;\n    }\n}\n```\n\nThese values are likely not the best, but they illustrate how this could be achieved.\n\n## Using Aspect Ratios\n\nMy favorite approach is to use aspect ratios, since they are percentage based, making them responsive by nature. However, these require a bit more thought and coding experience. [You can take a look at using aspect ratios in css here.](https://www.w3schools.com/howto/howto_css_aspect_ratio.asp)"},{"url":"/troubleshooting/fixing-black-borders-letterboxing/","title":"Fixing Black Borders Letterboxing","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Troubleshooting"},{"title":"Fixing Black Borders Letterboxing","url":"/troubleshooting/fixing-black-borders-letterboxing/"}],"content":"# Fixing Black Borders (Letterboxing) Around Video"},{"url":"/troubleshooting/fixing-playback-issues-in-certain-browsers/","title":"Fixing Playback Issues In Certain Browsers","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Troubleshooting"},{"title":"Fixing Playback Issues In Certain Browsers","url":"/troubleshooting/fixing-playback-issues-in-certain-browsers/"}],"content":"# Fixing Playback Issues in Certain Browsers\n\n If you notice your self hosted video background playing in one browser but not another, this is likely due to the video files themselves.\n\n A quick and easy way to determine if the video file itself is at fault, is to open the link to the `.mp4` or `.webm` directly in the browser to see if the video plays. If it does not play, that means that the video files' encoding is not compatible.\n\n If this is the case, you'll want to re-encode the video files to a codec that is most compatible:\n\n | File Type | Most Compatible Video Codec | Most Compatible Audio Codec\n| - | - | - |\n| MP4 | MP4 H.264 Video Codec | AAC Audio Codec\n| WebM | VP8 or VP9 Video Codec | Vorbis or Opus Audio Codec\n\nYou can [Learn more about optimizing your MP4 here](https://developer.mozilla.org/en-US/docs/Web/HTML/Supported_media_formats#MP4_H.264_AAC_or_MP3) or [learn more about optimizing your WebM here](https://developer.mozilla.org/en-US/docs/Web/HTML/Supported_media_formats#WebM)."},{"url":"/troubleshooting/mobile-playback-issues/","title":"Mobile Playback Issues","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Troubleshooting"},{"title":"Mobile Playback Issues","url":"/troubleshooting/mobile-playback-issues/"}],"content":"# Mobile Playback Issues\n\nVideo Background Pro will play on any device/browser that supports HTML5 `<video>`. As of August 2019, compatibility is at [97.25% globally amongst all users](https://caniuse.com/#feat=video). This is phenomenal support, but sometimes you may still see the video not playing on mobile. Here are a few things to look into if you are experiencing this issue.\n\n## Device Low Power Mode\n\nDevices on low power mode usually will automatically disable auto-playing video to save battery power. This is certainly the case with Apple devices like iPhone and iPad, and a lot of Android devices as well.\n\n## Device Doesn't Support Video Codecs\n\nThere are some cases where the codec that was used to create the video is not supported. Please visit our docs on File Types and Codecs for more information."},{"url":"/troubleshooting/youtube-playback-issues/","title":"Youtube Playback Issues","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Troubleshooting"},{"title":"Youtube Playback Issues","url":"/troubleshooting/youtube-playback-issues/"}],"content":"# YouTube Playback Issues\n\n## Make Sure Your YouTube URL Works\n\nSometimes a YouTube URL can get malformed by adding an extra character to the end or missing a character. It is always smart to copy the URL you are using for Video Background Pro, and paste it into an incognito browser window. If the video does not play, there is an issue with the URL.\n\n## YouTube Video Must Be Publicly Accessible\n\nThe YouTube video that you want as a video background must be publicly accessible. This means that the video must be either public or unlisted, but can **NOT** be private. You can make sure your YouTube video is publicly accessible by visiting your YouTube video URL in an incognito window to see if it plays.\n\n## YouTube Plugin Conflict\n\nIf you have checked the previous recommendations and they were not the cause of the issue, you may be experiencing an YouTube plugin conflict. This means that you have another plugin installed that is using the YouTube API that is conflicting with Video Background Pro. It is best to deactivate any YouTube plugins one by one on your WordPress site to rule out which plugin is causing the conflict."},{"url":"/examples/add-video-background-to-every-page/","title":"Add Video Background To Every Page","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Examples"},{"title":"Add Video Background To Every Page","url":"/examples/add-video-background-to-every-page/"}],"content":"# Adding a Video Background to Every Page\n\nIn some instances, you may want a video background on every page of your WordPress site. This is very straight forward thanks to the `[vidbg]` shortcode.\n\nYou can do so by pasting this function at the bottom of your `functions.php` file:\n\n```php\n/**\n * Add a video background to every page/post\n * \n * @version 05222018\n * @author Push Labs\n * @link https://pushlabs.co\n */\nfunction theme_prefix_vidbg_every_page() {\n  // Add [vidbg] params as needed. Be sure to change the container to your desired container.\n  echo do_shortcode('[vidbg container=\".YOUR_CONTAINER_HERE\" mp4=\"#\" webm=\"#\"]');\n}\nadd_action('wp_footer', 'theme_prefix_vidbg_every_page');\n```"},{"url":"/examples/playing-a-random-video/","title":"Playing A Random Video","breadcrumbs":[{"title":"Video Background Pro Docs","url":"/"},{"title":"Examples"},{"title":"Playing A Random Video","url":"/examples/playing-a-random-video/"}],"content":"# Playing a Random Video Background \n\nThere are some instances where you may want to cycle through a list of videos to be randomly played on page load. This can be dome with a simple function. Paste this at the bottom of the theme's `functions.php` file:\n\n```php\n/**\n * Select a random video from an array for the video background.\n *\n * @version 08092019\n * @author Push Labs\n * @link https://pushlabs.co\n */\nfunction theme_prefix_vidbg_random_video() {\n    // The page ID in which you want the video background shortcode to be rendered on.\n    $page_id = 4;\n\n    // If the page is not the ID specified above, do not render the rest of the code.\n    if (!is_page($page_id)) {\n        return;\n    }\n\n    // Create an array of video files. You will want to replace the values with your own URLs.\n    $videos = [\n      [\n          mp4 => '/video1.mp4',\n          webm => '/video1.webm',\n      ],\n      [\n          mp4 => '/video2.mp4',\n          webm => '/video2.webm',\n      ],\n      [\n          mp4 => '/video3.mp4',\n          webm => '/video3.webm',\n      ]\n    ];\n\n    // A random array selected from the above $videos array of arrays.\n    $get_random_video = array_rand($videos, 1);\n\n    // Add [vidbg] params as needed. Be sure to change the container to your desired container.\n    echo do_shortcode('[vidbg container=\".YOUR_CONTAINER_HERE\" mp4=\"' . $get_random_video[\"mp4\"] . '\" webm=\"' . $get_random_video[\"webm\"] . '\"]');\n}\nadd_action('wp_footer', 'theme_prefix_vidbg_random_video');\n```"}]
